<?xml version="1.0" ?>
<net batch="1" name="weights" version="6">
	<layers>
		<layer id="0" name="input_1" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Mul1_/Fused_Mul_/fused_power" precision="FP32" type="Power">
			<data power="1" scale="0.0078125" shift="-0.99609375"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="conv2d_1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="7,7" output="20" pads_begin="3,3" pads_end="3,3" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>20</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="3920"/>
				<biases offset="3920" size="80"/>
			</blobs>
		</layer>
		<layer id="3" name="conv2d_1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>20</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="max_pooling2d_1/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>20</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv2d_2/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="5,5" output="40" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>40</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4000" size="80000"/>
				<biases offset="84000" size="160"/>
			</blobs>
		</layer>
		<layer id="6" name="conv2d_2/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>40</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="max_pooling2d_2/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>40</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="conv2d_3/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="5,5" output="20" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>20</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="84160" size="80000"/>
				<biases offset="164160" size="80"/>
			</blobs>
		</layer>
		<layer id="9" name="conv2d_3/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>20</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="conv2d_4/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="5,5" output="10" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>10</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="164240" size="20000"/>
				<biases offset="184240" size="40"/>
			</blobs>
		</layer>
		<layer id="11" name="conv2d_4/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>10</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="conv2d_5/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="5,5" output="24" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</output>
			<blobs>
				<weights offset="184280" size="2400"/>
				<biases offset="186680" size="96"/>
			</blobs>
		</layer>
		<layer id="13" name="conv2d_5/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="max_pooling2d_3/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="conv2d_6/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="48" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<weights offset="186776" size="41472"/>
				<biases offset="228248" size="192"/>
			</blobs>
		</layer>
		<layer id="16" name="conv2d_6/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="max_pooling2d_4/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv2d_7/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="228440" size="41472"/>
				<biases offset="269912" size="96"/>
			</blobs>
		</layer>
		<layer id="19" name="conv2d_7/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="conv2d_8/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="12" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>12</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="270008" size="10368"/>
				<biases offset="280376" size="48"/>
			</blobs>
		</layer>
		<layer id="21" name="conv2d_8/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>12</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="conv2d_9/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="9,9" output="16" pads_begin="4,4" pads_end="4,4" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</output>
			<blobs>
				<weights offset="280424" size="5184"/>
				<biases offset="285608" size="64"/>
			</blobs>
		</layer>
		<layer id="23" name="conv2d_9/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="max_pooling2d_5/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv2d_10/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="7,7" output="32" pads_begin="3,3" pads_end="3,3" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<weights offset="285672" size="100352"/>
				<biases offset="386024" size="128"/>
			</blobs>
		</layer>
		<layer id="26" name="conv2d_10/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="max_pooling2d_6/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="conv2d_11/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="7,7" output="16" pads_begin="3,3" pads_end="3,3" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="386152" size="100352"/>
				<biases offset="486504" size="64"/>
			</blobs>
		</layer>
		<layer id="29" name="conv2d_11/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="conv2d_12/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="7,7" output="8" pads_begin="3,3" pads_end="3,3" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="486568" size="25088"/>
				<biases offset="511656" size="32"/>
			</blobs>
		</layer>
		<layer id="31" name="conv2d_12/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="concatenate_1/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>12</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>30</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="conv2d_13/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>30</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="511688" size="120"/>
				<biases offset="511808" size="4"/>
			</blobs>
		</layer>
		<layer id="34" name="conv2d_13/convolution/Transpose" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="strided_slice/Squeeze_shrink/Indices643_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="511812" size="4"/>
			</blobs>
		</layer>
		<layer id="36" name="strided_slice/Squeeze_shrink" precision="FP32" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>192</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="3" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="1" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="3" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0"/>
		<edge from-layer="8" from-port="3" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="1" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="3" to-layer="11" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="12" to-port="0"/>
		<edge from-layer="12" from-port="3" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="1" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="3" to-layer="16" to-port="0"/>
		<edge from-layer="16" from-port="1" to-layer="17" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="18" to-port="0"/>
		<edge from-layer="18" from-port="3" to-layer="19" to-port="0"/>
		<edge from-layer="19" from-port="1" to-layer="20" to-port="0"/>
		<edge from-layer="20" from-port="3" to-layer="21" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="22" to-port="0"/>
		<edge from-layer="22" from-port="3" to-layer="23" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0"/>
		<edge from-layer="24" from-port="1" to-layer="25" to-port="0"/>
		<edge from-layer="25" from-port="3" to-layer="26" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="27" to-port="0"/>
		<edge from-layer="27" from-port="1" to-layer="28" to-port="0"/>
		<edge from-layer="28" from-port="3" to-layer="29" to-port="0"/>
		<edge from-layer="29" from-port="1" to-layer="30" to-port="0"/>
		<edge from-layer="30" from-port="3" to-layer="31" to-port="0"/>
		<edge from-layer="11" from-port="1" to-layer="32" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="32" to-port="1"/>
		<edge from-layer="31" from-port="1" to-layer="32" to-port="2"/>
		<edge from-layer="32" from-port="3" to-layer="33" to-port="0"/>
		<edge from-layer="33" from-port="3" to-layer="34" to-port="0"/>
		<edge from-layer="34" from-port="1" to-layer="36" to-port="0"/>
		<edge from-layer="35" from-port="1" to-layer="36" to-port="1"/>
	</edges>
	<meta_data>
		<MO_version value="2019.2.0-436-gf5827d4"/>
		<cli_parameters>
			<blobs_as_inputs value="False"/>
			<caffe_parser_path value="DIR"/>
			<data_type value="float"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_experimental_IR_V10 value="False"/>
			<input_model value="DIR/weights.pb"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,768,1024,1]"/>
			<k value="DIR/CustomLayersMapping.xml"/>
			<keep_quantize_ops_in_IR value="False"/>
			<keep_shape_ops value="False"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="[(array([127.5]), None)]"/>
			<mean_values value="[127.5]"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_shapes value="[   1  768 1024    1]"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<scale value="128.0"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<version value="False"/>
			<unset unset_cli_parameters="batch, counts, disable_fusing, disable_gfusing, finegrain_fusing, generate_deprecated_IR_V2, input, input_checkpoint, input_meta_graph, input_proto, input_symbol, mean_file, mean_file_offsets, model_name, nd_prefix_name, output, pretrained_model_name, saved_model_dir, saved_model_tags, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_operation_patterns, tensorflow_subgraph_patterns, tensorflow_use_custom_operations_config"/>
		</cli_parameters>
	</meta_data>
</net>
