<?xml version="1.0" ?>
<net name="model_A_weights" version="10">
	<layers>
		<layer id="0" name="input_2" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,3,384,512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_35493553/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1,3,1,1" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Mul_/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_35503555/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="6" shape="1,3,1,1" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Add_/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="block1_conv1/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="12" shape="64,3,3,3" size="3456"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="block1_conv1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="block1_conv1/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="3468" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="block1_conv1/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="block1_conv1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="block1_conv2/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="3596" shape="64,64,3,3" size="73728"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="block1_conv2/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="block1_conv2/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="77324" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="block1_conv2/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="block1_conv2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="block1_pool/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2,2" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="block2_conv1/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="77452" shape="128,64,3,3" size="147456"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="block2_conv1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="block2_conv1/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="224908" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="block2_conv1/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="block2_conv1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="block2_conv2/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="225164" shape="128,128,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="block2_conv2/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="block2_conv2/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="520076" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="block2_conv2/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="block2_conv2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="block2_pool/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2,2" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="block3_conv1/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="520332" shape="256,128,3,3" size="589824"/>
			<output>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="block3_conv1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="block3_conv1/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1110156" shape="1,256,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="block3_conv1/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="block3_conv1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="block3_conv2/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="1110668" shape="256,256,3,3" size="1179648"/>
			<output>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="block3_conv2/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="block3_conv2/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="2290316" shape="1,256,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="block3_conv2/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="block3_conv2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="block3_conv3/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="2290828" shape="256,256,3,3" size="1179648"/>
			<output>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="block3_conv3/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="block3_conv3/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="3470476" shape="1,256,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="block3_conv3/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="block3_conv3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="block3_pool/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2,2" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="block4_conv1/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="3470988" shape="512,256,3,3" size="2359296"/>
			<output>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="block4_conv1/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="block4_conv1/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="5830284" shape="1,512,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="block4_conv1/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="block4_conv1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="block4_conv2/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="5831308" shape="512,512,3,3" size="4718592"/>
			<output>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="block4_conv2/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="block4_conv2/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="10549900" shape="1,512,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="block4_conv2/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="block4_conv2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="block4_conv3/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="10550924" shape="512,512,3,3" size="4718592"/>
			<output>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="block4_conv3/convolution" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="block4_conv3/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="15269516" shape="1,512,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="block4_conv3/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="block4_conv3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="conv2d_1/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="15270540" shape="512,512,3,3" size="4718592"/>
			<output>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="conv2d_1/convolution" type="Convolution" version="opset1">
			<data dilations="2,2" output_padding="0,0" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="conv2d_1/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="19989132" shape="1,512,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="conv2d_1/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="conv2d_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="conv2d_2/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="19990156" shape="512,512,3,3" size="4718592"/>
			<output>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="conv2d_2/convolution" type="Convolution" version="opset1">
			<data dilations="2,2" output_padding="0,0" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="conv2d_2/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="24708748" shape="1,512,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="conv2d_2/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="conv2d_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="conv2d_3/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="24709772" shape="512,512,3,3" size="4718592"/>
			<output>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="conv2d_3/convolution" type="Convolution" version="opset1">
			<data dilations="2,2" output_padding="0,0" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="conv2d_3/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="29428364" shape="1,512,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="conv2d_3/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="conv2d_3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="conv2d_4/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="29429388" shape="256,512,3,3" size="2359296"/>
			<output>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="conv2d_4/convolution" type="Convolution" version="opset1">
			<data dilations="2,2" output_padding="0,0" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="conv2d_4/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="31788684" shape="1,256,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="conv2d_4/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="conv2d_4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="conv2d_5/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="31789196" shape="128,256,3,3" size="589824"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="conv2d_5/convolution" type="Convolution" version="opset1">
			<data dilations="2,2" output_padding="0,0" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="conv2d_5/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="32379020" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="conv2d_5/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="conv2d_5/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="conv2d_6/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="32379276" shape="64,128,3,3" size="147456"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="conv2d_6/convolution" type="Convolution" version="opset1">
			<data dilations="2,2" output_padding="0,0" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="conv2d_6/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="32526732" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="conv2d_6/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="conv2d_6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="y_out/convolution/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="32526860" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="y_out/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="y_out/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="32526988" shape="1,1,1,1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="y_out/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="y_out/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="y_out/Relu/Transpose/Cast_15086_const" type="Const" version="opset1">
			<data element_type="i64" offset="32526990" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="y_out/Relu/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="output_1/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
        </layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="1" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="6" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="6" to-port="1"/>
		<edge from-layer="6" from-port="2" to-layer="8" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="1" to-layer="11" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="11" to-port="1"/>
		<edge from-layer="11" from-port="2" to-layer="13" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="13" to-port="1"/>
		<edge from-layer="13" from-port="2" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="17" to-port="0"/>
		<edge from-layer="16" from-port="1" to-layer="17" to-port="1"/>
		<edge from-layer="17" from-port="2" to-layer="19" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="19" to-port="1"/>
		<edge from-layer="19" from-port="2" to-layer="20" to-port="0"/>
		<edge from-layer="20" from-port="1" to-layer="22" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="22" to-port="1"/>
		<edge from-layer="22" from-port="2" to-layer="24" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="24" to-port="1"/>
		<edge from-layer="24" from-port="2" to-layer="25" to-port="0"/>
		<edge from-layer="25" from-port="1" to-layer="26" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="28" to-port="0"/>
		<edge from-layer="27" from-port="1" to-layer="28" to-port="1"/>
		<edge from-layer="28" from-port="2" to-layer="30" to-port="0"/>
		<edge from-layer="29" from-port="1" to-layer="30" to-port="1"/>
		<edge from-layer="30" from-port="2" to-layer="31" to-port="0"/>
		<edge from-layer="31" from-port="1" to-layer="33" to-port="0"/>
		<edge from-layer="32" from-port="1" to-layer="33" to-port="1"/>
		<edge from-layer="33" from-port="2" to-layer="35" to-port="0"/>
		<edge from-layer="34" from-port="1" to-layer="35" to-port="1"/>
		<edge from-layer="35" from-port="2" to-layer="36" to-port="0"/>
		<edge from-layer="36" from-port="1" to-layer="38" to-port="0"/>
		<edge from-layer="37" from-port="1" to-layer="38" to-port="1"/>
		<edge from-layer="38" from-port="2" to-layer="40" to-port="0"/>
		<edge from-layer="39" from-port="1" to-layer="40" to-port="1"/>
		<edge from-layer="40" from-port="2" to-layer="41" to-port="0"/>
		<edge from-layer="41" from-port="1" to-layer="42" to-port="0"/>
		<edge from-layer="42" from-port="1" to-layer="44" to-port="0"/>
		<edge from-layer="43" from-port="1" to-layer="44" to-port="1"/>
		<edge from-layer="44" from-port="2" to-layer="46" to-port="0"/>
		<edge from-layer="45" from-port="1" to-layer="46" to-port="1"/>
		<edge from-layer="46" from-port="2" to-layer="47" to-port="0"/>
		<edge from-layer="47" from-port="1" to-layer="49" to-port="0"/>
		<edge from-layer="48" from-port="1" to-layer="49" to-port="1"/>
		<edge from-layer="49" from-port="2" to-layer="51" to-port="0"/>
		<edge from-layer="50" from-port="1" to-layer="51" to-port="1"/>
		<edge from-layer="51" from-port="2" to-layer="52" to-port="0"/>
		<edge from-layer="52" from-port="1" to-layer="54" to-port="0"/>
		<edge from-layer="53" from-port="1" to-layer="54" to-port="1"/>
		<edge from-layer="54" from-port="2" to-layer="56" to-port="0"/>
		<edge from-layer="55" from-port="1" to-layer="56" to-port="1"/>
		<edge from-layer="56" from-port="2" to-layer="57" to-port="0"/>
		<edge from-layer="57" from-port="1" to-layer="59" to-port="0"/>
		<edge from-layer="58" from-port="1" to-layer="59" to-port="1"/>
		<edge from-layer="59" from-port="2" to-layer="61" to-port="0"/>
		<edge from-layer="60" from-port="1" to-layer="61" to-port="1"/>
		<edge from-layer="61" from-port="2" to-layer="62" to-port="0"/>
		<edge from-layer="62" from-port="1" to-layer="64" to-port="0"/>
		<edge from-layer="63" from-port="1" to-layer="64" to-port="1"/>
		<edge from-layer="64" from-port="2" to-layer="66" to-port="0"/>
		<edge from-layer="65" from-port="1" to-layer="66" to-port="1"/>
		<edge from-layer="66" from-port="2" to-layer="67" to-port="0"/>
		<edge from-layer="67" from-port="1" to-layer="69" to-port="0"/>
		<edge from-layer="68" from-port="1" to-layer="69" to-port="1"/>
		<edge from-layer="69" from-port="2" to-layer="71" to-port="0"/>
		<edge from-layer="70" from-port="1" to-layer="71" to-port="1"/>
		<edge from-layer="71" from-port="2" to-layer="72" to-port="0"/>
		<edge from-layer="72" from-port="1" to-layer="74" to-port="0"/>
		<edge from-layer="73" from-port="1" to-layer="74" to-port="1"/>
		<edge from-layer="74" from-port="2" to-layer="76" to-port="0"/>
		<edge from-layer="75" from-port="1" to-layer="76" to-port="1"/>
		<edge from-layer="76" from-port="2" to-layer="77" to-port="0"/>
		<edge from-layer="77" from-port="1" to-layer="79" to-port="0"/>
		<edge from-layer="78" from-port="1" to-layer="79" to-port="1"/>
		<edge from-layer="79" from-port="2" to-layer="81" to-port="0"/>
		<edge from-layer="80" from-port="1" to-layer="81" to-port="1"/>
		<edge from-layer="81" from-port="2" to-layer="82" to-port="0"/>
		<edge from-layer="82" from-port="1" to-layer="84" to-port="0"/>
		<edge from-layer="83" from-port="1" to-layer="84" to-port="1"/>
		<edge from-layer="84" from-port="2" to-layer="86" to-port="0"/>
		<edge from-layer="85" from-port="1" to-layer="86" to-port="1"/>
		<edge from-layer="86" from-port="2" to-layer="87" to-port="0"/>
		<edge from-layer="87" from-port="1" to-layer="89" to-port="0"/>
		<edge from-layer="88" from-port="1" to-layer="89" to-port="1"/>
		<edge from-layer="89" from-port="2" to-layer="91" to-port="0"/>
		<edge from-layer="90" from-port="1" to-layer="91" to-port="1"/>
		<edge from-layer="91" from-port="2" to-layer="92" to-port="0"/>
		<edge from-layer="92" from-port="1" to-layer="94" to-port="0"/>
		<edge from-layer="93" from-port="1" to-layer="94" to-port="1"/>
		<edge from-layer="94" from-port="2" to-layer="95" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2020.2.0-60-g0bc66e26ff"/>
		<cli_parameters>
			<blobs_as_inputs value="True"/>
			<caffe_parser_path value="DIR"/>
			<data_type value="FP16"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V2 value="False"/>
			<generate_deprecated_IR_V7 value="False"/>
			<generate_experimental_IR_V10 value="True"/>
			<input_model value="DIR/model_A_weights.pb"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,384,512,3]"/>
			<k value="DIR/CustomLayersMapping.xml"/>
			<keep_quantize_ops_in_IR value="True"/>
			<keep_shape_ops value="False"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="[(array([123.675, 116.28 , 103.53 ]), array([58.395, 57.12 , 57.375]))]"/>
			<mean_values value="[123.675,116.28,103.53]"/>
			<model_name value="model_A_weights"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="[  1 384 512   3]"/>
			<progress value="False"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<scale_values value="[58.395,57.12,57.375]"/>
			<silent value="False"/>
			<stream_output value="False"/>
			<unset unset_cli_parameters="batch, counts, disable_fusing, disable_gfusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, input_proto, input_symbol, mean_file, mean_file_offsets, nd_prefix_name, output, pretrained_model_name, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
