<?xml version="1.0" ?>
<net batch="1" name="ICV-RMNet-PD-ReID-Middle" version="6">
	<layers>
		<layer id="0" name="data" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Mul_12502/Fused_Mul_/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="6"/>
				<biases offset="6" size="6"/>
			</blobs>
		</layer>
		<layer id="2" name="init_block1/dim_inc/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="12" size="1728"/>
				<biases offset="1740" size="64"/>
			</blobs>
		</layer>
		<layer id="3" name="init_block1/dim_inc/fn" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="bottleneck1_1/dim_red/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1804" size="512"/>
				<biases offset="2316" size="16"/>
			</blobs>
		</layer>
		<layer id="5" name="bottleneck1_1/dim_red/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="bottleneck1_1/inner/dw1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="8" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2332" size="144"/>
				<biases offset="2476" size="16"/>
			</blobs>
		</layer>
		<layer id="7" name="bottleneck1_1/inner/dw1/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="bottleneck1_1/dim_inc/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2492" size="512"/>
				<biases offset="3004" size="64"/>
			</blobs>
		</layer>
		<layer id="9" name="bottleneck1_1/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="bottleneck1_1/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="bottleneck1_2/dim_red/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3068" size="512"/>
				<biases offset="3580" size="16"/>
			</blobs>
		</layer>
		<layer id="12" name="bottleneck1_2/dim_red/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="bottleneck1_2/inner/dw1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="8" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3596" size="144"/>
				<biases offset="3740" size="16"/>
			</blobs>
		</layer>
		<layer id="14" name="bottleneck1_2/inner/dw1/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="bottleneck1_2/dim_inc/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3756" size="512"/>
				<biases offset="4268" size="64"/>
			</blobs>
		</layer>
		<layer id="16" name="bottleneck1_2/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="bottleneck1_2/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="bottleneck1_3/dim_red/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4332" size="512"/>
				<biases offset="4844" size="16"/>
			</blobs>
		</layer>
		<layer id="19" name="bottleneck1_3/dim_red/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="bottleneck1_3/inner/dw1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="8" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4860" size="144"/>
				<biases offset="5004" size="16"/>
			</blobs>
		</layer>
		<layer id="21" name="bottleneck1_3/inner/dw1/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="bottleneck1_3/dim_inc/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5020" size="512"/>
				<biases offset="5532" size="64"/>
			</blobs>
		</layer>
		<layer id="23" name="bottleneck1_3/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="bottleneck1_3/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="bottleneck1_4/dim_red/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5596" size="512"/>
				<biases offset="6108" size="16"/>
			</blobs>
		</layer>
		<layer id="26" name="bottleneck1_4/dim_red/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="bottleneck1_4/inner/dw1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="8" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6124" size="144"/>
				<biases offset="6268" size="16"/>
			</blobs>
		</layer>
		<layer id="28" name="bottleneck1_4/inner/dw1/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="bottleneck1_4/dim_inc/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6284" size="512"/>
				<biases offset="6796" size="64"/>
			</blobs>
		</layer>
		<layer id="30" name="bottleneck1_4/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="bottleneck1_4/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="bottleneck2_0/skip/pooling" precision="FP16" type="Pooling">
			<data exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="bottleneck2_0/skip/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6860" size="4096"/>
				<biases offset="10956" size="128"/>
			</blobs>
		</layer>
		<layer id="34" name="bottleneck2_0/dim_red/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="11084" size="1024"/>
				<biases offset="12108" size="32"/>
			</blobs>
		</layer>
		<layer id="35" name="bottleneck2_0/dim_red/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="bottleneck2_0/inner/dw1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="12140" size="288"/>
				<biases offset="12428" size="32"/>
			</blobs>
		</layer>
		<layer id="37" name="bottleneck2_0/inner/dw1/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="bottleneck2_0/dim_inc/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="12460" size="2048"/>
				<biases offset="14508" size="128"/>
			</blobs>
		</layer>
		<layer id="39" name="bottleneck2_0/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="bottleneck2_0/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="bottleneck2_1/dim_red/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="14636" size="2048"/>
				<biases offset="16684" size="32"/>
			</blobs>
		</layer>
		<layer id="42" name="bottleneck2_1/dim_red/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="bottleneck2_1/inner/dw1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="16716" size="288"/>
				<biases offset="17004" size="32"/>
			</blobs>
		</layer>
		<layer id="44" name="bottleneck2_1/inner/dw1/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="bottleneck2_1/dim_inc/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="17036" size="2048"/>
				<biases offset="19084" size="128"/>
			</blobs>
		</layer>
		<layer id="46" name="bottleneck2_1/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="bottleneck2_1/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="bottleneck2_2/dim_red/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="19212" size="2048"/>
				<biases offset="21260" size="32"/>
			</blobs>
		</layer>
		<layer id="49" name="bottleneck2_2/dim_red/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="bottleneck2_2/inner/dw1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="21292" size="288"/>
				<biases offset="21580" size="32"/>
			</blobs>
		</layer>
		<layer id="51" name="bottleneck2_2/inner/dw1/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="bottleneck2_2/dim_inc/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="21612" size="2048"/>
				<biases offset="23660" size="128"/>
			</blobs>
		</layer>
		<layer id="53" name="bottleneck2_2/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="bottleneck2_2/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="bottleneck2_3/dim_red/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="23788" size="2048"/>
				<biases offset="25836" size="32"/>
			</blobs>
		</layer>
		<layer id="56" name="bottleneck2_3/dim_red/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="bottleneck2_3/inner/dw1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="25868" size="288"/>
				<biases offset="26156" size="32"/>
			</blobs>
		</layer>
		<layer id="58" name="bottleneck2_3/inner/dw1/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="bottleneck2_3/dim_inc/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="26188" size="2048"/>
				<biases offset="28236" size="128"/>
			</blobs>
		</layer>
		<layer id="60" name="bottleneck2_3/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="bottleneck2_3/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="bottleneck2_4/dim_red/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="28364" size="2048"/>
				<biases offset="30412" size="32"/>
			</blobs>
		</layer>
		<layer id="63" name="bottleneck2_4/dim_red/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="bottleneck2_4/inner/dw1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="30444" size="288"/>
				<biases offset="30732" size="32"/>
			</blobs>
		</layer>
		<layer id="65" name="bottleneck2_4/inner/dw1/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="bottleneck2_4/dim_inc/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="30764" size="2048"/>
				<biases offset="32812" size="128"/>
			</blobs>
		</layer>
		<layer id="67" name="bottleneck2_4/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="bottleneck2_4/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="bottleneck2_5/dim_red/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="32940" size="2048"/>
				<biases offset="34988" size="32"/>
			</blobs>
		</layer>
		<layer id="70" name="bottleneck2_5/dim_red/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="bottleneck2_5/inner/dw1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="35020" size="288"/>
				<biases offset="35308" size="32"/>
			</blobs>
		</layer>
		<layer id="72" name="bottleneck2_5/inner/dw1/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="bottleneck2_5/dim_inc/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="35340" size="2048"/>
				<biases offset="37388" size="128"/>
			</blobs>
		</layer>
		<layer id="74" name="bottleneck2_5/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="bottleneck2_5/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="bottleneck2_6/dim_red/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="37516" size="2048"/>
				<biases offset="39564" size="32"/>
			</blobs>
		</layer>
		<layer id="77" name="bottleneck2_6/dim_red/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="bottleneck2_6/inner/dw1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="39596" size="288"/>
				<biases offset="39884" size="32"/>
			</blobs>
		</layer>
		<layer id="79" name="bottleneck2_6/inner/dw1/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="bottleneck2_6/dim_inc/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="39916" size="2048"/>
				<biases offset="41964" size="128"/>
			</blobs>
		</layer>
		<layer id="81" name="bottleneck2_6/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="bottleneck2_6/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="bottleneck2_7/dim_red/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="42092" size="2048"/>
				<biases offset="44140" size="32"/>
			</blobs>
		</layer>
		<layer id="84" name="bottleneck2_7/dim_red/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="bottleneck2_7/inner/dw1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="44172" size="288"/>
				<biases offset="44460" size="32"/>
			</blobs>
		</layer>
		<layer id="86" name="bottleneck2_7/inner/dw1/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="bottleneck2_7/dim_inc/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="44492" size="2048"/>
				<biases offset="46540" size="128"/>
			</blobs>
		</layer>
		<layer id="88" name="bottleneck2_7/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="bottleneck2_7/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="bottleneck2_8/dim_red/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="46668" size="2048"/>
				<biases offset="48716" size="32"/>
			</blobs>
		</layer>
		<layer id="91" name="bottleneck2_8/dim_red/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="bottleneck2_8/inner/dw1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="48748" size="288"/>
				<biases offset="49036" size="32"/>
			</blobs>
		</layer>
		<layer id="93" name="bottleneck2_8/inner/dw1/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="bottleneck2_8/dim_inc/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="49068" size="2048"/>
				<biases offset="51116" size="128"/>
			</blobs>
		</layer>
		<layer id="95" name="bottleneck2_8/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="bottleneck2_8/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="bottleneck3_0/skip/pooling" precision="FP16" type="Pooling">
			<data exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="bottleneck3_0/skip/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>20</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<weights offset="51244" size="16384"/>
				<biases offset="67628" size="256"/>
			</blobs>
		</layer>
		<layer id="99" name="bottleneck3_0/dim_red/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="67884" size="4096"/>
				<biases offset="71980" size="64"/>
			</blobs>
		</layer>
		<layer id="100" name="bottleneck3_0/dim_red/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="bottleneck3_0/inner/dw1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<weights offset="72044" size="576"/>
				<biases offset="72620" size="64"/>
			</blobs>
		</layer>
		<layer id="102" name="bottleneck3_0/inner/dw1/fn" precision="FP16" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="bottleneck3_0/dim_inc/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<weights offset="72684" size="8192"/>
				<biases offset="80876" size="256"/>
			</blobs>
		</layer>
		<layer id="104" name="bottleneck3_0/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2">
