<?xml version="1.0"?>
<net name="model_A_weights" version="6" batch="1">
	<layers>
		<layer name="input_2" type="Input" precision="FP32" id="0">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="1">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</output>
			<blobs>
				<biases offset="0" size="12" />
				<weights offset="12" size="12" />
			</blobs>
		</layer>
		<layer name="block1_conv1/convolution" type="Convolution" precision="FP32" id="2">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</output>
			<blobs>
				<biases offset="24" size="256" />
				<weights offset="280" size="6912" />
			</blobs>
		</layer>
		<layer name="block1_conv1/Relu" type="ReLU" precision="FP32" id="3">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer name="block1_conv2/convolution" type="Convolution" precision="FP32" id="4">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7192" size="256" />
				<weights offset="7448" size="147456" />
			</blobs>
		</layer>
		<layer name="block1_conv2/Relu" type="ReLU" precision="FP32" id="5">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer name="block1_pool/MaxPool" type="Pooling" precision="FP32" id="6">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>768</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer name="block2_conv1/convolution" type="Convolution" precision="FP32" id="7">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<biases offset="154904" size="512" />
				<weights offset="155416" size="294912" />
			</blobs>
		</layer>
		<layer name="block2_conv1/Relu" type="ReLU" precision="FP32" id="8">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer name="block2_conv2/convolution" type="Convolution" precision="FP32" id="9">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<biases offset="450328" size="512" />
				<weights offset="450840" size="589824" />
			</blobs>
		</layer>
		<layer name="block2_conv2/Relu" type="ReLU" precision="FP32" id="10">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer name="block2_pool/MaxPool" type="Pooling" precision="FP32" id="11">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer name="block3_conv1/convolution" type="Convolution" precision="FP32" id="12">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1040664" size="1024" />
				<weights offset="1041688" size="1179648" />
			</blobs>
		</layer>
		<layer name="block3_conv1/Relu" type="ReLU" precision="FP32" id="13">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer name="block3_conv2/convolution" type="Convolution" precision="FP32" id="14">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2221336" size="1024" />
				<weights offset="2222360" size="2359296" />
			</blobs>
		</layer>
		<layer name="block3_conv2/Relu" type="ReLU" precision="FP32" id="15">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer name="block3_conv3/convolution" type="Convolution" precision="FP32" id="16">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4581656" size="1024" />
				<weights offset="4582680" size="2359296" />
			</blobs>
		</layer>
		<layer name="block3_conv3/Relu" type="ReLU" precision="FP32" id="17">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer name="block3_pool/MaxPool" type="Pooling" precision="FP32" id="18">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer name="block4_conv1/convolution" type="Convolution" precision="FP32" id="19">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<biases offset="6941976" size="2048" />
				<weights offset="6944024" size="4718592" />
			</blobs>
		</layer>
		<layer name="block4_conv1/Relu" type="ReLU" precision="FP32" id="20">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer name="block4_conv2/convolution" type="Convolution" precision="FP32" id="21">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<biases offset="11662616" size="2048" />
				<weights offset="11664664" size="9437184" />
			</blobs>
		</layer>
		<layer name="block4_conv2/Relu" type="ReLU" precision="FP32" id="22">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer name="block4_conv3/convolution" type="Convolution" precision="FP32" id="23">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<biases offset="21101848" size="2048" />
				<weights offset="21103896" size="9437184" />
			</blobs>
		</layer>
		<layer name="block4_conv3/Relu" type="ReLU" precision="FP32" id="24">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer name="conv2d_1/convolution" type="Convolution" precision="FP32" id="25">
			<data dilations="2,2" group="1" kernel="3,3" output="512" pads_begin="2,2" pads_end="2,2" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<biases offset="30541080" size="2048" />
				<weights offset="30543128" size="9437184" />
			</blobs>
		</layer>
		<layer name="conv2d_1/Relu" type="ReLU" precision="FP32" id="26">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer name="conv2d_2/convolution" type="Convolution" precision="FP32" id="27">
			<data dilations="2,2" group="1" kernel="3,3" output="512" pads_begin="2,2" pads_end="2,2" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<biases offset="39980312" size="2048" />
				<weights offset="39982360" size="9437184" />
			</blobs>
		</layer>
		<layer name="conv2d_2/Relu" type="ReLU" precision="FP32" id="28">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer name="conv2d_3/convolution" type="Convolution" precision="FP32" id="29">
			<data dilations="2,2" group="1" kernel="3,3" output="512" pads_begin="2,2" pads_end="2,2" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<biases offset="49419544" size="2048" />
				<weights offset="49421592" size="9437184" />
			</blobs>
		</layer>
		<layer name="conv2d_3/Relu" type="ReLU" precision="FP32" id="30">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer name="conv2d_4/convolution" type="Convolution" precision="FP32" id="31">
			<data dilations="2,2" group="1" kernel="3,3" output="256" pads_begin="2,2" pads_end="2,2" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<biases offset="58858776" size="1024" />
				<weights offset="58859800" size="4718592" />
			</blobs>
		</layer>
		<layer name="conv2d_4/Relu" type="ReLU" precision="FP32" id="32">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer name="conv2d_5/convolution" type="Convolution" precision="FP32" id="33">
			<data dilations="2,2" group="1" kernel="3,3" output="128" pads_begin="2,2" pads_end="2,2" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<biases offset="63578392" size="512" />
				<weights offset="63578904" size="1179648" />
			</blobs>
		</layer>
		<layer name="conv2d_5/Relu" type="ReLU" precision="FP32" id="34">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer name="conv2d_6/convolution" type="Convolution" precision="FP32" id="35">
			<data dilations="2,2" group="1" kernel="3,3" output="64" pads_begin="2,2" pads_end="2,2" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<biases offset="64758552" size="256" />
				<weights offset="64758808" size="294912" />
			</blobs>
		</layer>
		<layer name="conv2d_6/Relu" type="ReLU" precision="FP32" id="36">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer name="y_out/convolution" type="Convolution" precision="FP32" id="37">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="1" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<biases offset="65053720" size="4" />
				<weights offset="65053724" size="256" />
			</blobs>
		</layer>
		<layer name="y_out/Relu" type="ReLU" precision="FP32" id="38">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer name="y_out/Relu/Transpose" type="Permute" precision="FP32" id="39">
			<data order="0,2,3,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0" />
		<edge from-layer="1" from-port="1" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0" />
		<edge from-layer="3" from-port="1" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0" />
		<edge from-layer="8" from-port="1" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="11" to-port="0" />
		<edge from-layer="11" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="14" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0" />
		<edge from-layer="15" from-port="1" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="17" to-port="0" />
		<edge from-layer="17" from-port="1" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="19" to-port="0" />
		<edge from-layer="19" from-port="1" to-layer="20" to-port="0" />
		<edge from-layer="20" from-port="1" to-layer="21" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="22" to-port="0" />
		<edge from-layer="22" from-port="1" to-layer="23" to-port="0" />
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0" />
		<edge from-layer="24" from-port="1" to-layer="25" to-port="0" />
		<edge from-layer="25" from-port="1" to-layer="26" to-port="0" />
		<edge from-layer="26" from-port="1" to-layer="27" to-port="0" />
		<edge from-layer="27" from-port="1" to-layer="28" to-port="0" />
		<edge from-layer="28" from-port="1" to-layer="29" to-port="0" />
		<edge from-layer="29" from-port="1" to-layer="30" to-port="0" />
		<edge from-layer="30" from-port="1" to-layer="31" to-port="0" />
		<edge from-layer="31" from-port="1" to-layer="32" to-port="0" />
		<edge from-layer="32" from-port="1" to-layer="33" to-port="0" />
		<edge from-layer="33" from-port="1" to-layer="34" to-port="0" />
		<edge from-layer="34" from-port="1" to-layer="35" to-port="0" />
		<edge from-layer="35" from-port="1" to-layer="36" to-port="0" />
		<edge from-layer="36" from-port="1" to-layer="37" to-port="0" />
		<edge from-layer="37" from-port="1" to-layer="38" to-port="0" />
		<edge from-layer="38" from-port="1" to-layer="39" to-port="0" />
	</edges>
	<statistics>
		<layer>
			<name>Mul_/Fused_Mul_/FusedScaleShift_</name>
			<min>-2.117904, -2.035714, -1.804444</min>
			<max>2.248908, 2.428571, 2.640000</max>
		</layer>
		<layer>
			<name>block1_conv1/Relu</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>7.080550, 13.569965, 15.116420, 4.911353, 15.950348, 4.774294, 19.226219, 2.990743, 6.432447, 9.951985, 6.392441, 6.861337, 2.824437, 5.226093, 8.274965, 4.803324, 5.472131, 7.341044, 9.427684, 13.475131, 12.173501, 11.069140, 4.177819, 6.321651, 7.554646, 5.377670, 7.063874, 6.288102, 8.598495, 8.492741, 5.119900, 6.052667, 5.954255, 7.849813, 9.858134, 1.941994, 8.620990, 3.116612, 7.236389, 7.856912, 12.385991, 3.437545, 13.780567, 5.060620, 3.975162, 3.464363, 8.960841, 5.161012, 5.303040, 3.876147, 3.634147, 12.642879, 2.763468, 7.909749, 1.496394, 9.740744, 9.900895, 21.061607, 20.281342, 11.455018, 3.357248, 2.926193, 5.223624, 9.974023</max>
		</layer>
		<layer>
			<name>block1_conv1/convolution</name>
			<min>-8.435269, -12.661265, -13.283772, -5.332516, -15.517999, -4.953773, -18.457848, -4.188727, -5.750080, -11.158983, -7.680655, -6.653354, -6.680679, -4.723223, -7.757118, -3.924346, -6.291195, -8.781457, -8.796750, -12.777819, -11.766725, -10.076456, -3.982133, -4.531595, -5.038112, -5.061694, -6.311492, -7.057735, -8.433161, -9.795619, -4.284310, -5.698174, -5.944077, -6.634161, -8.535197, -5.795650, -10.653636, -5.179184, -6.988214, -6.926866, -12.040736, -4.038809, -13.445124, -4.313652, -6.034429, -5.650168, -10.518009, -5.757258, -4.431969, -4.772115, -3.593270, -10.424236, -5.317592, -6.491484, -2.530038, -9.288572, -9.737164, -19.111273, -19.194418, -9.681112, -4.426914, -3.935781, -5.650810, -9.381699</min>
			<max>7.080550, 13.569965, 15.116420, 4.911353, 15.950348, 4.774294, 19.226219, 2.990743, 6.432447, 9.951985, 6.392441, 6.861337, 2.824437, 5.226093, 8.274965, 4.803324, 5.472131, 7.341044, 9.427684, 13.475131, 12.173501, 11.069140, 4.177819, 6.321651, 7.554646, 5.377670, 7.063874, 6.288102, 8.598495, 8.492741, 5.119900, 6.052667, 5.954255, 7.849813, 9.858134, 1.941994, 8.620990, 3.116612, 7.236389, 7.856912, 12.385991, 3.437545, 13.780567, 5.060620, 3.975162, 3.464363, 8.960841, 5.161012, 5.303040, 3.876147, 3.634147, 12.642879, 2.763468, 7.909749, 1.496394, 9.740744, 9.900895, 21.061607, 20.281342, 11.455018, 3.357248, 2.926193, 5.223624, 9.974023</max>
		</layer>
		<layer>
			<name>block1_conv2/Relu</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>18.348625, 14.907207, 17.483059, 16.155937, 35.709885, 37.764069, 18.024078, 16.784637, 31.327568, 8.420590, 48.960556, 33.854061, 12.859243, 22.824085, 39.993366, 9.228025, 22.045626, 13.786318, 30.237247, 28.486668, 8.946706, 10.586464, 28.434650, 14.953768, 20.643696, 23.303585, 11.681957, 23.472092, 8.651888, 11.450151, 17.458076, 17.153339, 44.327068, 16.639246, 17.941572, 38.108833, 38.117737, 32.078354, 11.364222, 24.232304, 17.995405, 30.865742, 20.902279, 22.502148, 15.013044, 35.160145, 16.191193, 32.038185, 17.481642, 23.280504, 20.719057, 15.865088, 31.238905, 36.976234, 16.399525, 14.391483, 13.483139, 20.162758, 17.646194, 23.696148, 7.972584, 19.425632, 36.164295, 31.907524</max>
		</layer>
		<layer>
			<name>block1_conv2/convolution</name>
			<min>-21.282249, -24.016544, -48.266830, -11.980427, -42.744244, -32.835461, -15.478041, -19.930050, -37.044395, -21.787466, -60.851246, -53.256332, -23.797384, -19.409962, -34.111927, -15.314945, -22.654053, -15.887850, -39.702503, -23.123205, -21.687729, -11.341853, -35.062550, -6.491134, -21.520870, -28.096098, -20.014984, -24.010441, -18.740458, -22.640629, -18.078182, -16.054270, -47.311409, -11.824756, -40.005096, -44.438335, -45.540894, -20.099787, -29.333065, -29.031981, -7.897167, -32.990982, -37.543568, -24.444515, -21.497692, -50.087990, -17.832512, -36.307457, -47.171829, -34.272053, -37.778915, -14.384398, -29.619953, -37.022942, -27.329582, -18.370178, -24.358507, -45.147381, -16.672832, -15.488342, -14.877818, -23.201267, -36.321938, -43.043175</min>
			<max>18.348625, 14.907207, 17.483059, 16.155937, 35.709885, 37.764069, 18.024078, 16.784637, 31.327568, 8.420590, 48.960556, 33.854061, 12.859243, 22.824085, 39.993366, 9.228025, 22.045626, 13.786318, 30.237247, 28.486668, 8.946706, 10.586464, 28.434650, 14.953768, 20.643696, 23.303585, 11.681957, 23.472092, 8.651888, 11.450151, 17.458076, 17.153339, 44.327068, 16.639246, 17.941572, 38.108833, 38.117737, 32.078354, 11.364222, 24.232304, 17.995405, 30.865742, 20.902279, 22.502148, 15.013044, 35.160145, 16.191193, 32.038185, 17.481642, 23.280504, 20.719057, 15.865088, 31.238905, 36.976234, 16.399525, 14.391483, 13.483139, 20.162758, 17.646194, 23.696148, 7.972584, 19.425632, 36.164295, 31.907524</max>
		</layer>
		<layer>
			<name>block1_pool/MaxPool</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>18.348625, 14.907207, 17.483059, 16.155937, 35.709885, 37.764069, 18.024078, 16.784637, 31.327568, 8.420590, 48.960556, 33.854061, 12.859243, 22.824085, 39.993366, 9.228025, 22.045626, 13.786318, 30.237247, 28.486668, 8.946706, 10.586464, 28.434650, 14.953768, 20.643696, 23.303585, 11.681957, 23.472092, 8.651888, 11.450151, 17.458076, 17.153339, 44.327068, 16.639246, 17.941572, 38.108833, 38.117737, 32.078354, 11.364222, 24.232304, 17.995405, 30.865742, 20.902279, 22.502148, 15.013044, 35.160145, 16.191193, 32.038185, 17.481642, 23.280504, 20.719057, 15.865088, 31.238905, 36.976234, 16.399525, 14.391483, 13.483139, 20.162758, 17.646194, 23.696148, 7.972584, 19.425632, 36.164295, 31.907524</max>
		</layer>
		<layer>
			<name>block2_conv1/Relu</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>30.476810, 41.437145, 40.724037, 38.999813, 62.016594, 31.195372, 32.551987, 40.786648, 33.895908, 7.365781, 23.249630, 60.303745, 32.292156, 33.669937, 30.837717, 30.177944, 45.789619, 36.073948, 25.253010, 33.125858, 26.094786, 40.418678, 24.947996, 39.658184, 22.586361, 33.600899, 28.628275, 25.702459, 11.918763, 45.817085, 32.096539, 61.855995, 28.708675, 16.789024, 27.648888, 66.315712, 38.486008, 25.472258, 25.550495, 28.619633, 22.936512, 35.959660, 33.607513, 36.080894, 32.930756, 22.705578, 51.786446, 41.401146, 49.232361, 43.372025, 40.623295, 26.946415, 37.524376, 62.442383, 23.565155, 38.181892, 44.797806, 42.407433, 40.301495, 47.978981, 22.593359, 25.444725, 31.873386, 28.203838, 26.254051, 19.642315, 24.019585, 25.006189, 22.785061, 48.430466, 36.045864, 52.017166, 51.454773, 32.831467, 31.728401, 53.329681, 37.464928, 43.599068, 37.302536, 32.471397, 33.001202, 19.371012, 42.191902, 33.818958, 51.296852, 44.727905, 28.515142, 41.933250, 14.101746, 55.841057, 36.924129, 37.547234, 35.062916, 50.827370, 38.273254, 36.296917, 34.350163, 26.959015, 38.891701, 48.399132, 44.036861, 23.959038, 9.682408, 36.014915, 29.866852, 47.904270, 27.602001, 44.046524, 39.030441, 17.079794, 24.490093, 36.025063, 35.776482, 35.511597, 65.387329, 38.168129, 34.214558, 45.039505, 30.636585, 25.635256, 26.996389, 38.105427, 34.831291, 41.223778, 39.048416, 39.665386, 32.141773, 36.750725</max>
		</layer>
		<layer>
			<name>block2_conv1/convolution</name>
			<min>-28.240482, -45.002937, -61.728584, -39.154808, -48.649818, -68.828773, -35.128204, -51.652367, -41.051826, -34.260788, -32.111130, -33.628506, -45.152508, -46.907383, -45.738060, -83.311699, -35.948483, -52.127964, -99.474113, -35.477280, -33.430096, -54.575111, -57.074375, -35.823490, -36.067169, -57.336792, -49.496239, -90.513458, -20.082127, -36.038136, -29.069784, -56.110840, -31.509045, -58.929348, -62.411446, -54.479092, -73.964973, -65.860565, -36.075577, -41.112350, -55.528595, -26.566463, -60.574837, -67.882812, -62.863972, -21.699171, -30.488806, -41.707535, -35.910858, -51.687763, -52.927860, -51.651958, -79.865562, -49.386101, -85.749588, -47.990555, -26.634024, -48.203300, -65.350067, -34.953033, -47.414864, -41.047440, -31.010221, -38.922386, -59.755787, -66.952835, -32.629669, -36.723770, -65.261826, -47.327744, -71.617508, -43.693977, -29.456158, -31.198099, -49.720383, -33.284588, -42.495323, -53.529236, -73.333542, -59.111820, -20.263256, -32.565960, -37.842743, -34.817612, -35.303463, -54.330639, -17.221687, -50.195290, -25.520699, -56.295193, -48.693970, -29.508114, -39.032631, -30.295435, -22.301641, -42.922569, -41.596054, -45.354866, -58.844803, -30.519506, -52.553642, -34.315231, -21.447285, -46.126209, -35.677200, -42.038326, -61.415390, -39.236221, -43.718632, -27.564657, -57.088135, -76.209778, -36.218616, -52.701004, -49.004372, -30.331963, -31.239651, -34.956520, -46.216530, -65.281059, -69.610695, -67.052933, -39.169098, -27.128973, -31.464609, -38.095573, -76.088715, -64.073822</min>
			<max>30.476810, 41.437145, 40.724037, 38.999813, 62.016594, 31.195372, 32.551987, 40.786648, 33.895908, 7.365781, 23.249630, 60.303745, 32.292156, 33.669937, 30.837717, 30.177944, 45.789619, 36.073948, 25.253010, 33.125858, 26.094786, 40.418678, 24.947996, 39.658184, 22.586361, 33.600899, 28.628275, 25.702459, 11.918763, 45.817085, 32.096539, 61.855995, 28.708675, 16.789024, 27.648888, 66.315712, 38.486008, 25.472258, 25.550495, 28.619633, 22.936512, 35.959660, 33.607513, 36.080894, 32.930756, 22.705578, 51.786446, 41.401146, 49.232361, 43.372025, 40.623295, 26.946415, 37.524376, 62.442383, 23.565155, 38.181892, 44.797806, 42.407433, 40.301495, 47.978981, 22.593359, 25.444725, 31.873386, 28.203838, 26.254051, 19.642315, 24.019585, 25.006189, 22.785061, 48.430466, 36.045864, 52.017166, 51.454773, 32.831467, 31.728401, 53.329681, 37.464928, 43.599068, 37.302536, 32.471397, 33.001202, 19.371012, 42.191902, 33.818958, 51.296852, 44.727905, 28.515142, 41.933250, 14.101746, 55.841057, 36.924129, 37.547234, 35.062916, 50.827370, 38.273254, 36.296917, 34.350163, 26.959015, 38.891701, 48.399132, 44.036861, 23.959038, 9.682408, 36.014915, 29.866852, 47.904270, 27.602001, 44.046524, 39.030441, 17.079794, 24.490093, 36.025063, 35.776482, 35.511597, 65.387329, 38.168129, 34.214558, 45.039505, 30.636585, 25.635256, 26.996389, 38.105427, 34.831291, 41.223778, 39.048416, 39.665386, 32.141773, 36.750725</max>
		</layer>
		<layer>
			<name>block2_conv2/Relu</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>59.270660, 59.767490, 98.585503, 72.729950, 64.481720, 86.302429, 31.019390, 63.279190, 65.768120, 87.079315, 72.636124, 82.673500, 79.544769, 71.458191, 40.832321, 32.481133, 53.658279, 47.467228, 47.705765, 38.683041, 74.747040, 89.402374, 87.238541, 54.084415, 53.323540, 81.833374, 46.235115, 59.444393, 80.227341, 65.904617, 61.226074, 46.849525, 65.491997, 50.276104, 63.803928, 102.876312, 55.999332, 69.296753, 102.423141, 45.093746, 58.981041, 106.193146, 76.597282, 82.559158, 67.294830, 60.452312, 87.882576, 45.071625, 84.398064, 53.991112, 43.530590, 62.416630, 74.388901, 61.078697, 63.231216, 84.944160, 72.150398, 74.568436, 69.118828, 90.100700, 99.684586, 48.916679, 62.996628, 45.880394, 52.817188, 71.680176, 76.584488, 60.589798, 79.768456, 58.181480, 63.183800, 51.016602, 98.010529, 57.582664, 62.000690, 58.269321, 71.168213, 66.181488, 82.780617, 83.652405, 61.255402, 55.182281, 55.560108, 99.090958, 53.715790, 47.026913, 43.241650, 48.152668, 57.490654, 53.867401, 71.622864, 44.475384, 92.286171, 96.018768, 65.213753, 66.889481, 92.854401, 98.790497, 71.483337, 34.070610, 112.320076, 59.787151, 85.711349, 56.775600, 68.205360, 51.215019, 59.371403, 51.604637, 57.169014, 46.260658, 62.695786, 106.159241, 60.230488, 59.426079, 53.706726, 79.045586, 58.065956, 66.322075, 66.016556, 92.729607, 98.512596, 124.697159, 45.447823, 51.693367, 36.978451, 60.829685, 40.872009, 71.777557</max>
		</layer>
		<layer>
			<name>block2_conv2/convolution</name>
			<min>-91.496727, -35.031364, -84.224670, -65.309875, -69.224693, -73.855370, -45.761932, -104.887993, -69.442154, -88.121544, -55.415440, -74.076569, -67.108833, -77.391251, -78.330910, -48.466576, -76.358177, -35.075981, -52.824829, -48.267399, -72.841599, -56.703827, -86.113220, -76.511009, -65.418694, -48.569023, -81.945099, -75.195236, -70.156059, -52.488327, -80.538353, -82.034470, -56.373470, -65.383408, -43.018581, -81.596428, -57.218697, -62.431122, -95.614433, -48.276840, -61.178852, -66.144714, -50.687904, -71.161163, -120.774658, -104.779472, -82.083679, -41.672268, -74.012680, -29.989204, -115.975098, -96.399376, -79.998138, -53.074043, -46.789188, -68.810074, -75.336800, -63.155701, -76.173187, -66.087463, -99.927818, -58.354851, -54.133591, -31.856714, -38.823483, -77.460449, -79.722588, -69.269989, -62.018337, -67.422127, -78.883423, -70.079163, -93.853844, -61.235481, -122.203781, -84.488853, -53.554600, -42.911232, -66.846474, -69.609787, -95.539421, -76.415375, -42.981010, -109.500046, -59.271122, -50.232815, -74.654900, -72.744812, -44.670120, -19.250715, -63.739784, -74.832207, -103.477448, -73.542084, -98.763443, -47.326786, -46.230442, -55.421768, -90.248764, -61.243004, -95.759743, -56.319050, -82.256462, -71.166183, -39.008743, -57.925293, -58.796494, -56.837467, -87.523056, -57.437721, -87.208656, -95.213348, -63.730534, -51.612228, -85.228386, -97.566330, -80.215981, -74.113365, -72.825111, -61.405685, -77.562866, -99.592758, -94.346375, -70.411812, -54.370068, -82.533813, -47.432182, -26.174181</min>
			<max>59.270660, 59.767490, 98.585503, 72.729950, 64.481720, 86.302429, 31.019390, 63.279190, 65.768120, 87.079315, 72.636124, 82.673500, 79.544769, 71.458191, 40.832321, 32.481133, 53.658279, 47.467228, 47.705765, 38.683041, 74.747040, 89.402374, 87.238541, 54.084415, 53.323540, 81.833374, 46.235115, 59.444393, 80.227341, 65.904617, 61.226074, 46.849525, 65.491997, 50.276104, 63.803928, 102.876312, 55.999332, 69.296753, 102.423141, 45.093746, 58.981041, 106.193146, 76.597282, 82.559158, 67.294830, 60.452312, 87.882576, 45.071625, 84.398064, 53.991112, 43.530590, 62.416630, 74.388901, 61.078697, 63.231216, 84.944160, 72.150398, 74.568436, 69.118828, 90.100700, 99.684586, 48.916679, 62.996628, 45.880394, 52.817188, 71.680176, 76.584488, 60.589798, 79.768456, 58.181480, 63.183800, 51.016602, 98.010529, 57.582664, 62.000690, 58.269321, 71.168213, 66.181488, 82.780617, 83.652405, 61.255402, 55.182281, 55.560108, 99.090958, 53.715790, 47.026913, 43.241650, 48.152668, 57.490654, 53.867401, 71.622864, 44.475384, 92.286171, 96.018768, 65.213753, 66.889481, 92.854401, 98.790497, 71.483337, 34.070610, 112.320076, 59.787151, 85.711349, 56.775600, 68.205360, 51.215019, 59.371403, 51.604637, 57.169014, 46.260658, 62.695786, 106.159241, 60.230488, 59.426079, 53.706726, 79.045586, 58.065956, 66.322075, 66.016556, 92.729607, 98.512596, 124.697159, 45.447823, 51.693367, 36.978451, 60.829685, 40.872009, 71.777557</max>
		</layer>
		<layer>
			<name>block2_pool/MaxPool</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>59.270660, 59.767490, 98.585503, 72.729950, 64.481720, 86.302429, 31.019390, 63.279190, 65.768120, 87.079315, 72.636124, 82.673500, 79.544769, 71.458191, 40.832321, 32.481133, 53.658279, 47.467228, 47.705765, 38.683041, 74.747040, 89.402374, 87.238541, 54.084415, 53.323540, 81.833374, 46.235115, 59.444393, 80.227341, 65.904617, 61.226074, 46.849525, 65.491997, 50.276104, 63.803928, 102.876312, 55.999332, 69.296753, 102.423141, 45.093746, 58.981041, 106.193146, 76.597282, 82.559158, 67.294830, 60.452312, 87.882576, 45.071625, 84.398064, 53.991112, 43.530590, 62.416630, 74.388901, 61.078697, 63.231216, 84.944160, 72.150398, 74.568436, 69.118828, 90.100700, 99.684586, 48.916679, 62.996628, 45.880394, 52.817188, 71.680176, 76.584488, 60.589798, 79.768456, 58.181480, 63.183800, 51.016602, 98.010529, 57.582664, 62.000690, 58.269321, 71.168213, 66.181488, 82.780617, 83.652405, 61.255402, 55.182281, 55.560108, 99.090958, 53.715790, 47.026913, 43.241650, 48.152668, 57.490654, 53.867401, 71.622864, 44.475384, 92.286171, 96.018768, 65.213753, 66.889481, 92.854401, 98.790497, 71.483337, 34.070610, 112.320076, 59.787151, 85.711349, 56.775600, 68.205360, 51.215019, 59.371403, 51.604637, 57.169014, 46.260658, 62.695786, 106.159241, 60.230488, 59.426079, 53.706726, 79.045586, 58.065956, 66.322075, 66.016556, 92.729607, 98.512596, 124.697159, 45.447823, 51.693367, 36.978451, 60.829685, 40.872009, 71.777557</max>
		</layer>
		<layer>
			<name>block3_conv1/Relu</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>59.413059, 109.791809, 141.708939, 81.523773, 71.929176, 108.270813, 96.801399, 90.086136, 136.003235, 53.481411, 90.610054, 91.513962, 83.507896, 66.607071, 74.942802, 100.814102, 171.930695, 94.484993, 77.749405, 109.198677, 66.257698, 103.905952, 130.847961, 78.504913, 97.399582, 85.594788, 69.476105, 124.279198, 84.193214, 66.829659, 101.120872, 107.031715, 50.742889, 128.378845, 65.892181, 68.072395, 115.966240, 73.194328, 78.122620, 101.157715, 140.503357, 84.384819, 110.998177, 113.636383, 56.202389, 85.060303, 70.071465, 90.005310, 84.996628, 95.020828, 168.657959, 112.149307, 66.612114, 141.274658, 92.115540, 67.523277, 95.405067, 112.552742, 58.795956, 49.101856, 72.115768, 55.310318, 69.768295, 78.678612, 97.580513, 71.485130, 107.603638, 77.682030, 137.864944, 46.619099, 48.813660, 101.447052, 68.996704, 71.048355, 55.604717, 59.238605, 68.394775, 62.067436, 76.045609, 122.774147, 72.358124, 55.121876, 71.448776, 55.076698, 140.378677, 69.129791, 78.672821, 59.042114, 86.234962, 91.507126, 89.947998, 122.000725, 92.955872, 60.993622, 67.914490, 53.114754, 109.860603, 89.912163, 122.740837, 72.334549, 93.336426, 58.265053, 62.695621, 109.997093, 88.502129, 65.531021, 87.431038, 136.668762, 101.151855, 77.405479, 60.949383, 68.813156, 82.650436, 97.971962, 86.109680, 60.719276, 153.676208, 78.421875, 69.430832, 82.119675, 98.165123, 54.142410, 55.995090, 76.249687, 46.552654, 63.925266, 127.222534, 82.045563, 182.205032, 130.024673, 77.413254, 89.369415, 111.959297, 75.433121, 131.475983, 69.726341, 88.161362, 63.682343, 80.922783, 87.136620, 74.816650, 47.671921, 146.421600, 110.460243, 80.995682, 64.559898, 76.791687, 72.446472, 59.610905, 40.381744, 64.530670, 47.078243, 80.378929, 131.146835, 123.985214, 95.277283, 93.810509, 99.377220, 150.194763, 93.938850, 46.764797, 99.825340, 113.762192, 85.152603, 90.353104, 100.832474, 74.676575, 63.763649, 126.487228, 70.880699, 97.546539, 49.155941, 63.753883, 74.762749, 87.630562, 94.680504, 131.161819, 114.871185, 55.308231, 99.194725, 45.610828, 100.507301, 94.223083, 107.321030, 62.225090, 166.851654, 61.343990, 81.056725, 73.507011, 65.843994, 103.582031, 109.253189, 81.624649, 107.628235, 49.423889, 89.604797, 145.412643, 79.230461, 80.595978, 107.828995, 127.785400, 49.978180, 134.441635, 86.538498, 90.323837, 59.780075, 68.691025, 84.059456, 121.788109, 62.785511, 105.704689, 78.696091, 72.549019, 69.625084, 99.655128, 137.820129, 129.529999, 76.572052, 89.149300, 65.377991, 93.796227, 81.529686, 99.290192, 56.019390, 68.729820, 69.530144, 105.734650, 58.115292, 69.539429, 99.751801, 87.929665, 73.106491, 108.989769, 72.140038, 136.039505, 61.396259, 67.014069, 69.333679, 91.268982, 82.826004, 91.604225, 123.066185, 114.856697, 76.614998, 78.168747, 77.010185, 84.974960, 121.726624, 137.508316, 64.946869, 78.387085, 130.041504, 85.754120, 73.678543, 80.906204, 53.168793</max>
		</layer>
		<layer>
			<name>block3_conv1/convolution</name>
