<?xml version="1.0"?>
<net name="model_A_weights" version="6" batch="1">
	<layers>
		<layer name="strided_slice/Squeeze_shrink/Indices2366_const" type="Const" precision="I32" id="0">
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4" />
			</blobs>
		</layer>
		<layer name="input_2" type="Input" precision="FP32" id="1">
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="2">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4" size="12" />
				<weights offset="16" size="12" />
			</blobs>
		</layer>
		<layer name="block1_conv1/convolution" type="Convolution" precision="FP32" id="3">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<biases offset="28" size="256" />
				<weights offset="284" size="6912" />
			</blobs>
		</layer>
		<layer name="block1_conv1/Relu" type="ReLU" precision="FP32" id="4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer name="block1_conv2/convolution" type="Convolution" precision="FP32" id="5">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7196" size="256" />
				<weights offset="7452" size="147456" />
			</blobs>
		</layer>
		<layer name="block1_conv2/Relu" type="ReLU" precision="FP32" id="6">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer name="block1_pool/MaxPool" type="Pooling" precision="FP32" id="7">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer name="block2_conv1/convolution" type="Convolution" precision="FP32" id="8">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<biases offset="154908" size="512" />
				<weights offset="155420" size="294912" />
			</blobs>
		</layer>
		<layer name="block2_conv1/Relu" type="ReLU" precision="FP32" id="9">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer name="block2_conv2/convolution" type="Convolution" precision="FP32" id="10">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<biases offset="450332" size="512" />
				<weights offset="450844" size="589824" />
			</blobs>
		</layer>
		<layer name="block2_conv2/Relu" type="ReLU" precision="FP32" id="11">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer name="block2_pool/MaxPool" type="Pooling" precision="FP32" id="12">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>192</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer name="block3_conv1/convolution" type="Convolution" precision="FP32" id="13">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1040668" size="1024" />
				<weights offset="1041692" size="1179648" />
			</blobs>
		</layer>
		<layer name="block3_conv1/Relu" type="ReLU" precision="FP32" id="14">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer name="block3_conv2/convolution" type="Convolution" precision="FP32" id="15">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2221340" size="1024" />
				<weights offset="2222364" size="2359296" />
			</blobs>
		</layer>
		<layer name="block3_conv2/Relu" type="ReLU" precision="FP32" id="16">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer name="block3_conv3/convolution" type="Convolution" precision="FP32" id="17">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4581660" size="1024" />
				<weights offset="4582684" size="2359296" />
			</blobs>
		</layer>
		<layer name="block3_conv3/Relu" type="ReLU" precision="FP32" id="18">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer name="block3_pool/MaxPool" type="Pooling" precision="FP32" id="19">
			<data auto_pad="valid" exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>96</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="block4_conv1/convolution" type="Convolution" precision="FP32" id="20">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="6941980" size="2048" />
				<weights offset="6944028" size="4718592" />
			</blobs>
		</layer>
		<layer name="block4_conv1/Relu" type="ReLU" precision="FP32" id="21">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="block4_conv2/convolution" type="Convolution" precision="FP32" id="22">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="11662620" size="2048" />
				<weights offset="11664668" size="9437184" />
			</blobs>
		</layer>
		<layer name="block4_conv2/Relu" type="ReLU" precision="FP32" id="23">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="block4_conv3/convolution" type="Convolution" precision="FP32" id="24">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="512" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="21101852" size="2048" />
				<weights offset="21103900" size="9437184" />
			</blobs>
		</layer>
		<layer name="block4_conv3/Relu" type="ReLU" precision="FP32" id="25">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="conv2d_1/convolution" type="Convolution" precision="FP32" id="26">
			<data dilations="2,2" group="1" kernel="3,3" output="512" pads_begin="2,2" pads_end="2,2" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="30541084" size="2048" />
				<weights offset="30543132" size="9437184" />
			</blobs>
		</layer>
		<layer name="conv2d_1/Relu" type="ReLU" precision="FP32" id="27">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="conv2d_2/convolution" type="Convolution" precision="FP32" id="28">
			<data dilations="2,2" group="1" kernel="3,3" output="512" pads_begin="2,2" pads_end="2,2" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="39980316" size="2048" />
				<weights offset="39982364" size="9437184" />
			</blobs>
		</layer>
		<layer name="conv2d_2/Relu" type="ReLU" precision="FP32" id="29">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="conv2d_3/convolution" type="Convolution" precision="FP32" id="30">
			<data dilations="2,2" group="1" kernel="3,3" output="512" pads_begin="2,2" pads_end="2,2" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="49419548" size="2048" />
				<weights offset="49421596" size="9437184" />
			</blobs>
		</layer>
		<layer name="conv2d_3/Relu" type="ReLU" precision="FP32" id="31">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="conv2d_4/convolution" type="Convolution" precision="FP32" id="32">
			<data dilations="2,2" group="1" kernel="3,3" output="256" pads_begin="2,2" pads_end="2,2" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="58858780" size="1024" />
				<weights offset="58859804" size="4718592" />
			</blobs>
		</layer>
		<layer name="conv2d_4/Relu" type="ReLU" precision="FP32" id="33">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="conv2d_5/convolution" type="Convolution" precision="FP32" id="34">
			<data dilations="2,2" group="1" kernel="3,3" output="128" pads_begin="2,2" pads_end="2,2" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="63578396" size="512" />
				<weights offset="63578908" size="1179648" />
			</blobs>
		</layer>
		<layer name="conv2d_5/Relu" type="ReLU" precision="FP32" id="35">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="conv2d_6/convolution" type="Convolution" precision="FP32" id="36">
			<data dilations="2,2" group="1" kernel="3,3" output="64" pads_begin="2,2" pads_end="2,2" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="64758556" size="256" />
				<weights offset="64758812" size="294912" />
			</blobs>
		</layer>
		<layer name="conv2d_6/Relu" type="ReLU" precision="FP32" id="37">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="y_out/convolution" type="Convolution" precision="FP32" id="38">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="1" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="65053724" size="4" />
				<weights offset="65053728" size="256" />
			</blobs>
		</layer>
		<layer name="y_out/Relu" type="ReLU" precision="FP32" id="39">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="y_out/Relu/Transpose" type="Permute" precision="FP32" id="40">
			<data order="0,2,3,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>48</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="strided_slice/Squeeze_shrink" type="Squeeze" precision="FP32" id="41">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>48</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="41" to-port="1" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0" />
		<edge from-layer="3" from-port="1" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0" />
		<edge from-layer="8" from-port="1" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="11" to-port="0" />
		<edge from-layer="11" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="14" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0" />
		<edge from-layer="15" from-port="1" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="17" to-port="0" />
		<edge from-layer="17" from-port="1" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="19" to-port="0" />
		<edge from-layer="19" from-port="1" to-layer="20" to-port="0" />
		<edge from-layer="20" from-port="1" to-layer="21" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="22" to-port="0" />
		<edge from-layer="22" from-port="1" to-layer="23" to-port="0" />
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0" />
		<edge from-layer="24" from-port="1" to-layer="25" to-port="0" />
		<edge from-layer="25" from-port="1" to-layer="26" to-port="0" />
		<edge from-layer="26" from-port="1" to-layer="27" to-port="0" />
		<edge from-layer="27" from-port="1" to-layer="28" to-port="0" />
		<edge from-layer="28" from-port="1" to-layer="29" to-port="0" />
		<edge from-layer="29" from-port="1" to-layer="30" to-port="0" />
		<edge from-layer="30" from-port="1" to-layer="31" to-port="0" />
		<edge from-layer="31" from-port="1" to-layer="32" to-port="0" />
		<edge from-layer="32" from-port="1" to-layer="33" to-port="0" />
		<edge from-layer="33" from-port="1" to-layer="34" to-port="0" />
		<edge from-layer="34" from-port="1" to-layer="35" to-port="0" />
		<edge from-layer="35" from-port="1" to-layer="36" to-port="0" />
		<edge from-layer="36" from-port="1" to-layer="37" to-port="0" />
		<edge from-layer="37" from-port="1" to-layer="38" to-port="0" />
		<edge from-layer="38" from-port="1" to-layer="39" to-port="0" />
		<edge from-layer="39" from-port="1" to-layer="40" to-port="0" />
		<edge from-layer="40" from-port="1" to-layer="41" to-port="0" />
	</edges>
	<statistics>
		<layer>
			<name>Mul_/Fused_Mul_/FusedScaleShift_</name>
			<min>-2.117904, -2.035714, -1.804444</min>
			<max>2.248908, 2.428571, 2.640000</max>
		</layer>
		<layer>
			<name>block1_conv1/Relu</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>8.507739, 14.299111, 15.792051, 5.184526, 16.805620, 4.916582, 19.226219, 2.891266, 7.058429, 10.482492, 6.392441, 7.006895, 2.867744, 5.215793, 8.865866, 4.675415, 5.167384, 7.341044, 8.780505, 15.045295, 12.314062, 11.820367, 4.194962, 6.528371, 7.477442, 5.852132, 6.964018, 6.400860, 8.457488, 8.288980, 5.216198, 6.036170, 6.583181, 8.794473, 11.591431, 2.271207, 9.165010, 3.308061, 7.079298, 8.275338, 12.411246, 3.686049, 14.765003, 4.926149, 3.889119, 3.323926, 8.961479, 4.844033, 5.250311, 3.920287, 3.565174, 13.319996, 2.883192, 10.448852, 1.500901, 9.966568, 10.544172, 21.897566, 20.302794, 12.066501, 3.164636, 3.022316, 5.110479, 9.665218</max>
		</layer>
		<layer>
			<name>block1_conv1/convolution</name>
			<min>-8.282139, -13.379830, -15.073718, -5.480737, -15.938388, -5.228467, -18.493416, -4.115756, -5.610764, -12.109503, -7.695146, -7.537311, -6.862728, -4.642679, -9.940102, -3.832265, -6.268001, -8.802232, -8.601548, -13.431540, -11.893745, -11.115637, -4.195568, -5.074339, -5.114552, -5.207079, -5.956770, -7.460170, -8.011709, -10.060973, -4.451746, -5.689265, -6.488808, -7.384661, -10.978026, -5.744472, -10.883510, -5.001843, -6.553118, -7.410388, -12.040736, -4.241822, -13.830149, -4.227647, -5.721387, -5.807738, -10.484164, -5.633398, -4.182049, -4.845903, -3.544200, -12.058726, -5.318553, -8.637304, -2.514630, -9.288820, -10.067211, -20.848690, -19.193613, -11.693699, -4.490622, -3.912806, -5.452210, -9.626983</min>
			<max>8.507739, 14.299111, 15.792051, 5.184526, 16.805620, 4.916582, 19.226219, 2.891266, 7.058429, 10.482492, 6.392441, 7.006895, 2.867744, 5.215793, 8.865866, 4.675415, 5.167384, 7.341044, 8.780505, 15.045295, 12.314062, 11.820367, 4.194962, 6.528371, 7.477442, 5.852132, 6.964018, 6.400860, 8.457488, 8.288980, 5.216198, 6.036170, 6.583181, 8.794473, 11.591431, 2.271207, 9.165010, 3.308061, 7.079298, 8.275338, 12.411246, 3.686049, 14.765003, 4.926149, 3.889119, 3.323926, 8.961479, 4.844033, 5.250311, 3.920287, 3.565174, 13.319996, 2.883192, 10.448852, 1.500901, 9.966568, 10.544172, 21.897566, 20.302794, 12.066501, 3.164636, 3.022316, 5.110479, 9.665218</max>
		</layer>
		<layer>
			<name>block1_conv2/Relu</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>19.109753, 14.891121, 17.158720, 20.929855, 36.131424, 43.692291, 19.638987, 24.439943, 40.163685, 9.122922, 54.644497, 34.585529, 16.378313, 23.769096, 36.130142, 10.032425, 22.540073, 14.698862, 36.394394, 26.835079, 8.885431, 11.153614, 29.264061, 14.739114, 25.665939, 23.016884, 12.700232, 21.135311, 8.875546, 11.394785, 20.785837, 20.597694, 50.443962, 16.799450, 17.241072, 41.130611, 51.437065, 30.471077, 11.883175, 25.635429, 19.441917, 30.148361, 21.204569, 23.011883, 17.049906, 47.610329, 16.291363, 33.675072, 18.251657, 24.669668, 21.614628, 15.797694, 29.798937, 37.889297, 17.667740, 14.714855, 16.603115, 20.468586, 20.815767, 25.906487, 8.987828, 19.942822, 39.618076, 34.991528</max>
		</layer>
		<layer>
			<name>block1_conv2/convolution</name>
			<min>-21.307091, -24.303864, -48.709560, -15.671125, -40.590496, -45.907677, -19.556486, -24.147415, -43.513367, -21.378208, -61.243298, -51.971191, -25.368530, -21.410700, -29.421829, -16.908342, -23.370571, -15.675895, -44.882729, -22.383423, -21.169764, -11.177622, -34.925705, -8.108328, -27.898129, -29.035114, -21.073246, -24.898464, -18.909184, -24.088650, -22.810942, -19.491669, -55.231815, -11.353169, -39.715260, -49.918549, -55.887100, -19.647346, -31.045376, -30.756950, -10.018642, -32.986931, -39.439796, -25.529533, -29.151020, -59.447109, -16.486805, -38.433086, -47.031124, -34.979568, -38.810501, -15.126519, -29.691177, -43.001907, -25.758858, -17.630655, -25.247511, -47.520672, -19.130903, -16.047266, -14.888418, -22.327265, -39.786854, -41.729206</min>
			<max>19.109753, 14.891121, 17.158720, 20.929855, 36.131424, 43.692291, 19.638987, 24.439943, 40.163685, 9.122922, 54.644497, 34.585529, 16.378313, 23.769096, 36.130142, 10.032425, 22.540073, 14.698862, 36.394394, 26.835079, 8.885431, 11.153614, 29.264061, 14.739114, 25.665939, 23.016884, 12.700232, 21.135311, 8.875546, 11.394785, 20.785837, 20.597694, 50.443962, 16.799450, 17.241072, 41.130611, 51.437065, 30.471077, 11.883175, 25.635429, 19.441917, 30.148361, 21.204569, 23.011883, 17.049906, 47.610329, 16.291363, 33.675072, 18.251657, 24.669668, 21.614628, 15.797694, 29.798937, 37.889297, 17.667740, 14.714855, 16.603115, 20.468586, 20.815767, 25.906487, 8.987828, 19.942822, 39.618076, 34.991528</max>
		</layer>
		<layer>
			<name>block1_pool/MaxPool</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>19.109753, 14.891121, 17.158720, 20.929855, 36.131424, 43.692291, 19.638987, 24.439943, 40.163685, 9.122922, 54.644497, 34.585529, 16.378313, 23.769096, 36.130142, 10.032425, 22.540073, 14.698862, 36.394394, 26.835079, 8.885431, 11.153614, 29.264061, 14.739114, 25.665939, 23.016884, 12.700232, 21.135311, 8.875546, 11.394785, 20.785837, 20.597694, 50.443962, 16.799450, 17.241072, 41.130611, 51.437065, 30.471077, 11.883175, 25.635429, 19.441917, 30.148361, 21.204569, 23.011883, 17.049906, 47.610329, 16.291363, 33.675072, 18.251657, 24.669668, 21.614628, 15.797694, 29.798937, 37.889297, 17.667740, 14.714855, 16.603115, 20.468586, 20.815767, 25.906487, 8.987828, 19.942822, 39.618076, 34.991528</max>
		</layer>
		<layer>
			<name>block2_conv1/Relu</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>33.545216, 36.658714, 46.942482, 37.015999, 60.973202, 34.227844, 37.029182, 40.162037, 33.733345, 7.445207, 26.777390, 46.571411, 34.303146, 30.856564, 32.379803, 25.804840, 56.964779, 39.903614, 29.076118, 36.182560, 28.774944, 43.748276, 25.281244, 38.738380, 22.755249, 39.881851, 33.525299, 30.476892, 12.047040, 41.696903, 40.171909, 59.563904, 32.830872, 18.344557, 36.779732, 76.320045, 42.428371, 26.334774, 25.038643, 34.262455, 22.413887, 42.040802, 32.253071, 38.324257, 39.161919, 21.928940, 55.390121, 41.054653, 46.978065, 57.206623, 46.298035, 27.992559, 37.921402, 63.150608, 22.406769, 39.623932, 49.285500, 49.709831, 47.166206, 56.365829, 25.007858, 26.406296, 30.842407, 32.283512, 30.541853, 19.525051, 25.299955, 28.089233, 25.143005, 63.337181, 41.628304, 52.198868, 49.418884, 35.758904, 32.743298, 52.108307, 41.922390, 56.962044, 41.229469, 39.742657, 39.209267, 23.241394, 45.941875, 45.681831, 54.807278, 42.828171, 30.645565, 39.141724, 14.654940, 52.837765, 38.518398, 40.680393, 36.703880, 54.769051, 41.753605, 37.971542, 31.347847, 32.697418, 39.096718, 51.499416, 47.633110, 31.437479, 9.880398, 38.495911, 35.340309, 48.396748, 32.492687, 53.688187, 51.706112, 17.094067, 26.432936, 33.193211, 42.600288, 38.349342, 51.043777, 46.919735, 34.264801, 50.354202, 37.425564, 29.376907, 32.388420, 33.661743, 35.555355, 49.942352, 41.175907, 45.321564, 38.996773, 39.403038</max>
		</layer>
		<layer>
			<name>block2_conv1/convolution</name>
			<min>-28.418148, -50.703323, -77.199158, -39.037483, -67.066620, -76.988571, -34.218414, -60.707245, -42.722725, -29.807869, -43.089016, -46.224533, -43.682377, -62.100510, -58.514229, -89.545830, -35.137032, -57.219887, -108.690552, -42.377266, -32.465919, -60.546741, -57.717201, -38.459549, -47.256844, -64.517509, -56.039635, -99.283089, -20.706905, -35.493011, -39.091808, -49.185925, -31.166317, -66.891693, -78.977501, -51.121750, -71.037750, -73.422241, -36.057724, -42.949097, -67.250191, -30.717230, -76.188957, -74.437225, -64.505844, -28.878860, -29.217503, -40.502823, -35.105564, -69.284561, -59.564548, -62.626953, -94.806900, -58.267269, -105.449738, -63.571785, -28.603624, -58.642899, -70.811424, -37.965588, -48.321915, -44.300041, -35.906551, -37.410454, -59.752151, -75.889404, -42.461716, -38.537468, -75.047302, -60.743858, -75.565002, -46.292988, -33.905285, -36.030857, -48.162766, -36.548027, -42.518925, -65.137383, -70.889870, -59.671795, -20.931133, -33.647812, -45.557167, -35.124676, -41.300980, -53.522808, -18.120895, -50.844582, -31.705456, -56.977863, -53.003075, -29.158478, -39.603458, -41.758614, -25.821112, -45.916676, -44.220451, -45.896744, -66.477852, -38.430729, -59.578011, -33.488174, -26.365450, -41.799797, -34.767399, -42.074162, -57.054375, -41.861069, -59.136742, -25.394167, -50.553741, -107.321609, -36.754250, -60.745564, -47.826462, -37.179550, -38.028694, -39.425278, -56.187843, -84.509056, -74.411514, -61.620190, -42.786068, -30.353661, -37.332371, -36.042862, -74.026894, -74.533714</min>
			<max>33.545216, 36.658714, 46.942482, 37.015999, 60.973202, 34.227844, 37.029182, 40.162037, 33.733345, 7.445207, 26.777390, 46.571411, 34.303146, 30.856564, 32.379803, 25.804840, 56.964779, 39.903614, 29.076118, 36.182560, 28.774944, 43.748276, 25.281244, 38.738380, 22.755249, 39.881851, 33.525299, 30.476892, 12.047040, 41.696903, 40.171909, 59.563904, 32.830872, 18.344557, 36.779732, 76.320045, 42.428371, 26.334774, 25.038643, 34.262455, 22.413887, 42.040802, 32.253071, 38.324257, 39.161919, 21.928940, 55.390121, 41.054653, 46.978065, 57.206623, 46.298035, 27.992559, 37.921402, 63.150608, 22.406769, 39.623932, 49.285500, 49.709831, 47.166206, 56.365829, 25.007858, 26.406296, 30.842407, 32.283512, 30.541853, 19.525051, 25.299955, 28.089233, 25.143005, 63.337181, 41.628304, 52.198868, 49.418884, 35.758904, 32.743298, 52.108307, 41.922390, 56.962044, 41.229469, 39.742657, 39.209267, 23.241394, 45.941875, 45.681831, 54.807278, 42.828171, 30.645565, 39.141724, 14.654940, 52.837765, 38.518398, 40.680393, 36.703880, 54.769051, 41.753605, 37.971542, 31.347847, 32.697418, 39.096718, 51.499416, 47.633110, 31.437479, 9.880398, 38.495911, 35.340309, 48.396748, 32.492687, 53.688187, 51.706112, 17.094067, 26.432936, 33.193211, 42.600288, 38.349342, 51.043777, 46.919735, 34.264801, 50.354202, 37.425564, 29.376907, 32.388420, 33.661743, 35.555355, 49.942352, 41.175907, 45.321564, 38.996773, 39.403038</max>
		</layer>
		<layer>
			<name>block2_conv2/Relu</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>62.223606, 83.071678, 99.160324, 84.946411, 80.049911, 81.191856, 36.028866, 67.080757, 94.882782, 72.930237, 78.300812, 82.526634, 82.575768, 75.240654, 44.843765, 37.160049, 52.029430, 62.305126, 50.159698, 45.175888, 82.950447, 84.278671, 94.420586, 53.754772, 66.730896, 54.456608, 49.830799, 59.430069, 78.836853, 66.085915, 74.218819, 45.184563, 77.016373, 52.626160, 63.738522, 85.671356, 63.548920, 75.487816, 122.937546, 47.969315, 72.369415, 113.984787, 86.354034, 96.793129, 69.324448, 60.394371, 90.786476, 50.726681, 88.787712, 57.296345, 47.868999, 69.035057, 91.763756, 58.639084, 66.594391, 83.440544, 84.539131, 80.592964, 69.049690, 76.762642, 118.141022, 50.511024, 68.483017, 57.485191, 80.457916, 81.269379, 72.505234, 61.536194, 81.757744, 54.690674, 63.386604, 54.002346, 134.147675, 67.090935, 67.904991, 79.183029, 73.856766, 59.729862, 85.177292, 107.398911, 67.998512, 60.260197, 59.376778, 108.523880, 55.840782, 55.425003, 44.720711, 63.201534, 64.516418, 63.385429, 75.815109, 48.870071, 78.232109, 91.106865, 71.359818, 74.322098, 82.957939, 104.242409, 90.417961, 35.627949, 111.451355, 60.801697, 97.044640, 55.322239, 86.740295, 51.401787, 66.041847, 52.274418, 66.792496, 56.196159, 75.973160, 104.124435, 64.687630, 59.238468, 56.719742, 102.589798, 70.813042, 74.500145, 77.722832, 104.196632, 119.956001, 158.097763, 56.102551, 53.713303, 39.135288, 58.762054, 47.328964, 72.979279</max>
		</layer>
		<layer>
			<name>block2_conv2/convolution</name>
			<min>-89.934563, -42.008610, -84.378899, -72.074379, -73.267578, -81.428741, -54.002754, -104.366592, -112.015259, -78.736931, -61.807163, -76.856277, -76.444809, -81.593407, -76.961929, -57.244644, -84.090820, -40.098778, -62.066765, -51.828289, -77.024658, -62.896843, -84.330910, -79.500702, -53.033691, -56.830093, -82.724678, -74.948204, -80.157761, -61.120590, -89.921478, -93.126938, -63.183083, -70.031082, -49.584118, -75.458405, -70.398376, -72.999504, -101.178413, -56.136375, -66.202896, -75.005608, -68.956940, -63.936909, -120.142776, -99.847260, -107.015930, -46.163357, -76.671631, -43.308758, -106.166077, -105.120781, -71.299316, -69.235306, -57.220558, -77.721115, -96.963623, -67.314445, -77.218727, -71.546059, -116.379539, -62.481323, -47.084904, -37.118412, -42.915833, -83.580345, -78.566521, -66.248535, -84.380409, -63.499496, -82.654312, -75.060425, -92.702164, -68.453911, -145.359329, -92.616508, -71.518517, -49.114960, -71.241127, -74.807198, -110.287956, -79.135750, -49.403320, -103.058075, -58.773109, -57.730709, -83.391914, -69.176247, -44.919407, -20.956522, -81.930611, -81.404831, -89.042511, -81.557739, -99.749519, -52.311085, -53.936218, -69.977631, -96.214264, -75.787476, -106.916718, -57.487282, -87.545944, -74.398438, -51.606148, -61.566906, -64.368736, -58.234909, -81.397484, -59.184055, -95.522995, -88.423233, -68.974426, -56.194866, -81.918488, -99.287689, -96.925308, -93.779427, -91.927277, -66.171844, -100.426453, -116.519409, -110.377945, -80.016937, -52.064667, -91.356056, -48.847183, -34.286457</min>
			<max>62.223606, 83.071678, 99.160324, 84.946411, 80.049911, 81.191856, 36.028866, 67.080757, 94.882782, 72.930237, 78.300812, 82.526634, 82.575768, 75.240654, 44.843765, 37.160049, 52.029430, 62.305126, 50.159698, 45.175888, 82.950447, 84.278671, 94.420586, 53.754772, 66.730896, 54.456608, 49.830799, 59.430069, 78.836853, 66.085915, 74.218819, 45.184563, 77.016373, 52.626160, 63.738522, 85.671356, 63.548920, 75.487816, 122.937546, 47.969315, 72.369415, 113.984787, 86.354034, 96.793129, 69.324448, 60.394371, 90.786476, 50.726681, 88.787712, 57.296345, 47.868999, 69.035057, 91.763756, 58.639084, 66.594391, 83.440544, 84.539131, 80.592964, 69.049690, 76.762642, 118.141022, 50.511024, 68.483017, 57.485191, 80.457916, 81.269379, 72.505234, 61.536194, 81.757744, 54.690674, 63.386604, 54.002346, 134.147675, 67.090935, 67.904991, 79.183029, 73.856766, 59.729862, 85.177292, 107.398911, 67.998512, 60.260197, 59.376778, 108.523880, 55.840782, 55.425003, 44.720711, 63.201534, 64.516418, 63.385429, 75.815109, 48.870071, 78.232109, 91.106865, 71.359818, 74.322098, 82.957939, 104.242409, 90.417961, 35.627949, 111.451355, 60.801697, 97.044640, 55.322239, 86.740295, 51.401787, 66.041847, 52.274418, 66.792496, 56.196159, 75.973160, 104.124435, 64.687630, 59.238468, 56.719742, 102.589798, 70.813042, 74.500145, 77.722832, 104.196632, 119.956001, 158.097763, 56.102551, 53.713303, 39.135288, 58.762054, 47.328964, 72.979279</max>
		</layer>
		<layer>
			<name>block2_pool/MaxPool</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>62.223606, 83.071678, 99.160324, 84.946411, 80.049911, 81.191856, 36.028866, 67.080757, 94.882782, 72.930237, 78.300812, 82.526634, 82.575768, 75.240654, 44.843765, 37.160049, 52.029430, 62.305126, 50.159698, 45.175888, 82.950447, 84.278671, 94.420586, 53.754772, 66.730896, 54.456608, 49.830799, 59.430069, 78.836853, 66.085915, 74.218819, 45.184563, 77.016373, 52.626160, 63.738522, 85.671356, 63.548920, 75.487816, 122.937546, 47.969315, 72.369415, 113.984787, 86.354034, 96.793129, 69.324448, 60.394371, 90.786476, 50.726681, 88.787712, 57.296345, 47.868999, 69.035057, 91.763756, 58.639084, 66.594391, 83.440544, 84.539131, 80.592964, 69.049690, 76.762642, 118.141022, 50.511024, 68.483017, 57.485191, 80.457916, 81.269379, 72.505234, 61.536194, 81.757744, 54.690674, 63.386604, 54.002346, 134.147675, 67.090935, 67.904991, 79.183029, 73.856766, 59.729862, 85.177292, 107.398911, 67.998512, 60.260197, 59.376778, 108.523880, 55.840782, 55.425003, 44.720711, 63.201534, 64.516418, 63.385429, 75.815109, 48.870071, 78.232109, 91.106865, 71.359818, 74.322098, 82.957939, 104.242409, 90.417961, 35.627949, 111.451355, 60.801697, 97.044640, 55.322239, 86.740295, 51.401787, 66.041847, 52.274418, 66.792496, 56.196159, 75.973160, 104.124435, 64.687630, 59.238468, 56.719742, 102.589798, 70.813042, 74.500145, 77.722832, 104.196632, 119.956001, 158.097763, 56.102551, 53.713303, 39.135288, 58.762054, 47.328964, 72.979279</max>
		</layer>
		<layer>
			<name>block3_conv1/Relu</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
